[
  {
    "name": "Linda Chandler",
    "title": "Leadership, Governance, Risk",
    "bio": "Linda J. Chandler is a seasoned technology, risk, and cybersecurity leader with more than twenty-five years of experience across the financial services, technology, and consulting sectors. Based in the San Francisco Bay Area, she has established a professional identity centered on bridging the gap between complex technical requirements and enterprise-level strategic goals. Her career includes significant leadership roles at prominent institutions such as Bank of the West, Wells Fargo, and Circle Internet Financial. Throughout these tenures, she has specialized in developing robust frameworks for cyber risk management, operational resilience, and third-party oversight within highly regulated global environments.\n\nHer extensive background in leadership is characterized by a proven ability to manage large-scale global teams and navigate diverse corporate cultures. As a Senior Vice President and IT Risk Officer, she led an agile organization of over one hundred professionals to mature cybersecurity capabilities and align technical operations with board-level risk appetites. Ms. Chandler has successfully directed multi-year strategic roadmaps, including the implementation of integrated governance, risk, and compliance platforms that provide real-time visibility into business continuity and emerging threats. Her expertise extends into the evolving landscape of digital assets, where she has designed enterprise risk management programs specifically tailored for the crypto and stablecoin industry.\n\nToday, she provides high-level advisory services to large regional banks and data technology firms, focusing on upgrading security controls and information security programs to meet international standards. Her approach combines deep technical knowledge from her background in computer science with the strategic business acumen gained through an MBA from The Wharton School. By aligning cybersecurity hygiene with business objectives, she ensures that organizations can pursue growth ambitions while maintaining a proactive defense against systemic risks. Ms. Chandler remains a vital asset to firms seeking to enhance their digital trust, regulatory compliance, and long-term operational stability in an increasingly complex global marketplace.",
    "headshot": "assets/headshots/lc.png",
    "linkedin": ""
  },
  {
    "name": "Jeff Martin",
    "title": "Architecture, Product & Technical Delivery",
    "bio": "Jeff Martin is an enterprise Agile coach, product manager, and solution architect working at the intersection of cybersecurity, data, and large-scale delivery organizations. His career spans regulated financial services, consumer brands, and technology platforms, where he supports teams responsible for complex, high-risk systems. He operates primarily in environments that demand both technical rigor and disciplined execution, including cyber threat detection, identity and access management, and enterprise reporting. His professional identity is grounded in aligning delivery models, product strategy, and automation capabilities to improve reliability, transparency, and outcomes across large organizations.\n\nHe brings depth across Agile transformation, product leadership, and technical architecture, supported by hands-on development and automation experience. He has led enterprise coaching and SAFe transformations, designed formal education programs for Scrum Masters and Product Owners, and managed delivery leaders responsible for multiple teams. His work consistently emphasizes measurable results, including significant reductions in rework, improved delivery predictability, and sustained cost savings through platform optimization and tooling consolidation. He has also designed automation pipelines and reporting solutions that connect security telemetry, operational data, and executive visibility, enabling faster decision-making and regulatory remediation in high-scrutiny environments.\n\nStrategically, he provides value by translating organizational goals into execution models that teams can sustain over time. He works closely with engineering leaders, executives, and risk stakeholders to ensure delivery practices support both innovation and control. His client relevance lies in his ability to bridge strategy, process, and technology without over-reliance on abstraction or jargon. Looking forward, his focus remains on responsible application of AI-enabled automation, pragmatic portfolio management, and scalable delivery systems that help organizations adapt to increasing complexity while maintaining trust, compliance, and operational resilience.",
    "headshot": "assets/headshots/marcus-chen.jpg",
    "linkedin": ""
  }
]
