[
  {
    "name": "Linda Chandler",
    "title": "",
    "bio": "Linda J. Chandler is a seasoned technology, risk, and cybersecurity leader with more than twenty-five years of experience across the financial services, technology, and consulting sectors. Based in the San Francisco Bay Area, she has established a professional identity centered on bridging the gap between complex technical requirements and enterprise-level strategic goals. Her career includes significant leadership roles at prominent institutions such as Bank of the West, Wells Fargo, and Circle Internet Financial. Throughout these tenures, she has specialized in developing robust frameworks for cyber risk management, operational resilience, and third-party oversight within highly regulated global environments.\n\r\n\r  Her extensive background in leadership is characterized by a proven ability to manage large-scale global teams and navigate diverse corporate cultures. As a Senior Vice President and IT Risk Officer, she led an agile organization of over one hundred professionals to mature cybersecurity capabilities and align technical operations with board-level risk appetites. Ms. Chandler has successfully directed multi-year strategic roadmaps, including the implementation of integrated governance, risk, and compliance platforms that provide real-time visibility into business continuity and emerging threats. Her expertise extends into the evolving landscape of digital assets, where she has designed enterprise risk management programs specifically tailored for the crypto and stablecoin industry.\n\r\n\r  Today, she provides high-level advisory services to large regional banks and data technology firms, focusing on upgrading security controls and information security programs to meet international standards. Her approach combines deep technical knowledge from her background in computer science with the strategic business acumen gained through an MBA from The Wharton School. By aligning cybersecurity hygiene with business objectives, she ensures that organizations can pursue growth ambitions while maintaining a proactive defense against systemic risks. Ms. Chandler remains a vital asset to firms seeking to enhance their digital trust, regulatory compliance, and long-term operational stability in an increasingly complex global marketplace.",
    "headshot": "assets/headshots/lc.png",
    "linkedin": ""
  },
  {
    "name": "Jeff Martin",
    "title": "",
    "bio": "Marcus is a veteran of large-scale GRC transformations at Fortune 500 financial institutions. Prior to CyberClean, he led a 3-year consent order remediation program at a top-10 regional bank, building the evidence collection infrastructure and control monitoring frameworks that achieved full regulatory closure. He designed the CyberClean sprint-based delivery model and owns our methodology standards across all five modules.",
    "headshot": "assets/headshots/marcus-chen.jpg",
    "linkedin": ""
  }
]
