[
  {
    "name": "Linda Chandler",
    "title": "Leadership, Governance, Risk",
    "bio": "Linda J. Chandler is a seasoned technology, risk, and cybersecurity leader with more than twenty-five years of experience across the financial services, technology, and consulting sectors. Based in the San Francisco Bay Area, she has established a professional identity centered on bridging the gap between complex technical requirements and enterprise-level strategic goals. Her career includes significant leadership roles at prominent institutions such as Bank of the West, Wells Fargo, and Circle Internet Financial. Throughout these tenures, she has specialized in developing robust frameworks for cyber risk management, operational resilience, and third-party oversight within highly regulated global environments.\n\nHer extensive background in leadership is characterized by a proven ability to manage large-scale global teams and navigate diverse corporate cultures. As a Senior Vice President and IT Risk Officer, she led an agile organization of over one hundred professionals to mature cybersecurity capabilities and align technical operations with board-level risk appetites. Ms. Chandler has successfully directed multi-year strategic roadmaps, including the implementation of integrated governance, risk, and compliance platforms that provide real-time visibility into business continuity and emerging threats. Her expertise extends into the evolving landscape of digital assets, where she has designed enterprise risk management programs specifically tailored for the crypto and stablecoin industry.\n\nToday, she provides high-level advisory services to large regional banks and data technology firms, focusing on upgrading security controls and information security programs to meet international standards. Her approach combines deep technical knowledge from her background in computer science with the strategic business acumen gained through an MBA from The Wharton School. By aligning cybersecurity hygiene with business objectives, she ensures that organizations can pursue growth ambitions while maintaining a proactive defense against systemic risks. Ms. Chandler remains a vital asset to firms seeking to enhance their digital trust, regulatory compliance, and long-term operational stability in an increasingly complex global marketplace.",
    "headshot": "assets/headshots/lc.png",
    "linkedin": ""
  },
  {
    "name": "Jeff Martin",
    "title": "Architecture, Product & Technical Delivery",
    "bio": "Jeff Martin is an enterprise Agile coach, product manager, and solution architect working at the intersection of cybersecurity, data, and large-scale delivery organizations. His career spans regulated financial services, consumer brands, and technology platforms, where he supports teams responsible for complex, high-risk systems. He operates primarily in environments that demand both technical rigor and disciplined execution, including cyber threat detection, identity and access management, and enterprise reporting. His professional identity is grounded in aligning delivery models, product strategy, and automation capabilities to improve reliability, transparency, and outcomes across large organizations.\n\nHe brings depth across Agile transformation, product leadership, and technical architecture, supported by hands-on development and automation experience. He has led enterprise coaching and SAFe transformations, designed formal education programs for Scrum Masters and Product Owners, and managed delivery leaders responsible for multiple teams. His work consistently emphasizes measurable results, including significant reductions in rework, improved delivery predictability, and sustained cost savings through platform optimization and tooling consolidation. He has also designed automation pipelines and reporting solutions that connect security telemetry, operational data, and executive visibility, enabling faster decision-making and regulatory remediation in high-scrutiny environments.\n\nStrategically, he provides value by translating organizational goals into execution models that teams can sustain over time. He works closely with engineering leaders, executives, and risk stakeholders to ensure delivery practices support both innovation and control. His client relevance lies in his ability to bridge strategy, process, and technology without over-reliance on abstraction or jargon. Looking forward, his focus remains on responsible application of AI-enabled automation, pragmatic portfolio management, and scalable delivery systems that help organizations adapt to increasing complexity while maintaining trust, compliance, and operational resilience.",
    "headshot": "assets/headshots/marcus-chen.jpg",
    "linkedin": ""
  },
  {
    "name": "Gary Archuleta",
    "title": "Leadership, Progam Management, Talent Management",
    "bio": "Gary L. Archuleta, Jr. is a senior financial services technology and program management executive with more than twenty years of experience driving enterprise-scale initiatives within highly regulated environments. Throughout his career, he has specialized in managing complex portfolios that intersect cybersecurity, regulatory remediation, and large-scale mergers and acquisitions. Based in the San Francisco Bay Area, he has established a professional identity rooted in the ability to align sophisticated technical requirements with overarching business objectives and strict compliance mandates. His industry context is defined by a consistent track record of navigating the rigorous demands of global banking institutions and federal regulators.\n\nHis leadership depth is characterized by the successful oversight of multi-million-dollar programs and the management of high-performing, cross-functional teams. Archuleta has demonstrated significant impact by transforming traditional organizational structures into agile, capability-based delivery models that enhance operational efficiency. Most recently, he served as a delivery lead for critical regulatory findings at Truist Financial, where he achieved early regulator approval and completed projects under the allocated budget. His previous tenure at Bank of the West included directing the enterprise decoupling from BNP Paribas and leading the cybersecurity portfolio, where he managed an annual budget of thirty million dollars.\n\nThe strategic value Archuleta provides stems from his extensive experience engaging with boards of directors, C-suite executives, and regulatory bodies. He acts as a trusted advisor on enterprise risk and integration, ensuring that complex transitions and security enhancements are executed with minimal disruption to the business. His forward-looking focus remains centered on building sustainable delivery frameworks that can withstand the evolving landscape of cyber threats and shifting financial regulations. By combining technical expertise with a disciplined approach to governance, he ensures that organizations remain resilient and competitive during periods of significant structural or technological change.",
    "headshot": "assets/headshots/ga.png",
    "linkedin": ""
  },
  {
    "name": "Troy Allen",
    "title": "Architecture, Governance, Risk",
    "bio": "Troy Allen brings more than eight years of experience advising organizations on network infrastructure, architecture, and systems security, with focused expertise in financial services regulatory remediation. His background spans information technology and telecommunications, where he has supported both cloud and on-premise environments. With over three years of project management experience and hands-on involvement in cybersecurity operations, he operates at the intersection of technical execution and governance alignment. His professional focus centers on strengthening enterprise visibility, improving control maturity, and advancing secure infrastructure practices within complex environments.\n\nTroy has led the development and enhancement of logging and monitoring standards aligned to NIST SP 800-53 and FFIEC guidance, serving as a primary contributor during federal audit remediation efforts. He has acted as project manager for network asset remediation initiatives, ensuring deliverables were completed on schedule while coordinating cross-functional stakeholders. His technical expertise includes Splunk Enterprise Security configuration, CrowdStrike Falcon EDR implementation, Oracle Cloud Infrastructure security design, and Cisco network architecture. He has installed and configured enterprise logging agents, built detection rules, triaged security events, and supported incident response investigations. Earlier in his career, he led large-scale telecommunications deployments, overseeing county-wide VoIP implementations involving hundreds of endpoints and extensive stakeholder coordination.\n\nThrough this combination of regulatory alignment, operational execution, and infrastructure engineering, Allen delivers practical security improvements that stand up to audit scrutiny and real-world threats. He emphasizes documentation discipline, measurable control design, and sustainable processes that strengthen long-term resilience. He remains focused on elevating team capability, refining detection strategy, and supporting financial institutions in maintaining defensible, well-governed security programs.",
    "headshot": "assets/headshots/ta.jpg",
    "linkedin": ""
  }
]
